// Цикл for




// for(иницилизація(повтореніе( let i=0)); условіе проверяется (i <= 5); пост-вираженіе(т.е ми его увелічівае ілі уменьшаем на 1(i+=1))) {
//     // тело цикла
//     console.log(i)
// }
// Cтрокі не перебіраются прі помощі цікла фор



// Pre-increment та Post-increment(не рекомендую)

// for (let i = 0; i < 10; i++) {
//     console.log(i);
// }



// Напіші скріпт якій порахує общу сумму зарплат працивників.
// Кількість працівників буде в змінной employees.
// Зарплата кожного працівника це случайне число від 500 до 5000;
// // Запісаті сумму в змінну та вівесті в консоль.

// Сделать переменную
// const minSalary = 500;
// const maxSalary = 5000;
// const employees = 10;
// let totalSalary = 0;

// // перебрать работніков в цікле
// for (let i = 1; i < employees; i += 1){
   
//     // сгенеріть случаное зп
//     const salary = Math.round(Math.random() * (maxSalary - minSalary) + minSalary,);

// console.log(`зп работника номер ${i} - ${salary} `)

// // добавіть к тоталу 
//  totalSalary += salary;

//  // і лог
//  console.log('totalSalary: ', totalSalary);
// }
   








// Напіші скріпт якій порахує сумму усіх четних чисел
// які входят в діапазон чісла в змінних від min до max.
// напріклад якщо min= 0 та max = 5, то діапазон 0-5 
// і в нем два четних чісла 2 та 4, іх сумма 6.

// // обьевить переменную
// const min = 0;
// const max = 5;
// let total = 0;

// // фор от мин до макс с шагом в один
// for (let i = min; i <= max; i+= 1) {

//     // проверяем от деления
//     if (i % 2 !== 0) {
//         console.log('Не четное: ', i);
//         continue;
//     }
//        console.log('четное: ', i)

//         total += i;
//     }


// console.log('total : ', total);



