// Напиши скрипт обработки покупки в магази

// Баланс пользователя  хранится в переменной balance

// сумма покупки хранится в переменной Payment

// Перед проверкой ввести сообщение:
//  'Общая стоимость заказа  [ число] кредитов. Проверяем кол-во доступных средств на счету'


//  Если сумма покупки не перевышает баланс:

//  - Вычесть из баланса сумму покупки
//  - Вывести сообщение "На счету осталось [ число] кредитов"
//  - Если сумма покупки превышает баланс:
//  - Вывести сообщение "На счету недостаточно средств для проведения операции!"
//  - В конце вывести сообщение "Операция завершена"


// 1 вары
//  let balance = 10000;
//  const payment = 2000;


//  console.log(`Общая стоимость заказа ${payment} кредитов. Проверяем кол-во доступных средств на счету`)


//  if (payment <= balance) {
//     console.log('ok');

//     balance -= payment;

//     console.log(`На счету осталось ${balance} кредитов`);}
//     else {
//         console.log('На счету недостаточно средств для проведения операции!')
//     }
 
// console.log('Операция завершена');



 
